<?php 
require_once "Fox.class.php";


/** Задача 1 Реализовать класс, описывающий животное. Класс животного, методы и
свойства определяются самостоятельно студентом. Количество свойств: не менее 5
Количество методов: не менее 7 Проверить работу методов, создав объект класса и
вызвав его методы. */




$fox = new Fox();


echo $fox->run() . "<br>";
echo $fox->run();

// $fox->nap();

// $fox -> say();

// $fox -> hunt();

// $fox -> eat();

// $fox -> run();

// $fox -> breathe();

// echo $fox -> addArms();

// echo $fox -> getAmountOfLimbs();
